{
  "eagle_config": {
    "architectures": [
      "LlamaForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 4096,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 1,
    "num_key_value_heads": 32,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.32.0.dev0",
    "use_cache": false,
    "vocab_size": 32000
  },
  "num_steps": 3,
  "num_step_models": 1,
  "step_mapping": {
    "0": 0,
    "1": 0,
    "2": 0
  },
  "use_adapter": false
}